# Этот текст используется в сопровождении меню бота
# Во время переключений между клавиатурами, сверху написаны 
# подсказки для пользователей
menu_reply_text = {
    'hello_message' : 'Привет! Что будем добавлять?',
    'expense_message' : 'Выберите из списка:',
    'completed_message' : 'Запись добавлена в Google таблицу',
    'after_descr_msg' : 'Если нужно отредактировать значения наименования и описания можно повторно нажать на 1 или 2, или просто нажмите добавить запись',
    'add_discr_msg' : 'Укажите описание тут. Его можно будет изменить при необходимости до отправки',
    'after_item_msg' : 'Также можно указать подробное описание нажмите на кнопу 2, для редактирования названия нажмите 1, или просто нажмите добавить запись',
    'add_item_msg' : 'Укажите наименование тут. Его можно будет изменить при необходимости до отправки'
}    