# Словарь с названиями кнопок и соответствующими emoji
# Используется для клавиатуры, отображающей категории расходов
expense_buttons_text = {
    'public_utilities': '🏠 Комм.услуги',
    'housing_Rent': '🏘 аренда',
    'phone_Internet': '📱 тел.интернет',
    'commission_payment': '💸 комиссионные',
    'subscription_payment': '📺 абонентсая плата',
    'household_products': '🛍 товары для дома',
    'health': '🩺 здоровье',
    'sport_fitness': '🏋️ спорт и фитнес',
    'hygiene_cosmetics': '💄 гигиена, косметика',
    'alcohol': '🍷 алкоголь',
    'products': '🛒 продукты питания',
    'education': '🎓 образование',
    'trading_business': '📈 трейдинг, бизнес',
    'investment': '💰 инвестиции',
    'charity': '❤️ благотворительность',
    'gifts': '🎁 подарки',
    'events': '🎫 события',
    'restaurants': '🍽 рестораны, кафе',
    'entertainments': '🎢 развлечения',
    'flight_Intercity': '✈️ авиа, межгород. транспорт',
    'taxi': '🚕 такси',
    'public_transport': '🚌 общественный транспорт',
    'vehicle': '🚗 автотранспорт',
    'fuel': '⛽ топливо',
    'everyday_life_tech': '🖥 бытовая техника',
    'house_furniture_tools': '🛏 мебель,предметы для дома',
    'clothes_footwear': '👕 одежда, обувь',
    'accessory': '👜 аксесуары',
    'hand_tools': '🛠 ручные инструменты',
    'building_materials': '🧱 стройматериалы',
    'private_debt': '💵 частный займ',
    'credit': '💳 банковский кредит',
    'other': '🔖 прочие'
}

menu_buttons_text = {
    'add_new': '📝 Добавить',
    'expenses': '💵 Расходы',
    'income': '💰 Доходы',
    'back': '⬅️ Домой',
    'descr':'🗒️ Редактировать описание',
    'add_record': '✏️ Записать в базу'
}

# menu_buttons для обработки call.data
# приложение к предыдущему блоку
add_new = 'add_new'
expenses = 'expenses'
income = 'income'
back = 'back'
item_button = 'item'
descr_button = 'description'
add_record = 'add_record'

